docs/notes/python.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Python</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="/static/main.css" />
</head>
<body>
<div id="preamble" class="status">
<nav id="navbar" class="cf">
  <ul class="cf">
    <li class="fl">
      <a href="/">cfclrk</a>
    </li>
    <li class="fr">
      <a href="/articles/home.html">Articles</a>
    </li>
    <li class="fr">
      <a href="/notes/home.html">Notes</a>
    </li>
	<li class="fr">
      <a href="/cloudformation/home.html">CloudFormation</a>
    </li>
  </ul>
</nav>
</div>
<div id="content" class="content">
<header>
<h1 class="title">Python</h1>
</header><nav id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgbe7c725">Pyenv</a>
<ul>
<li><a href="#org023ad48">Latest Version</a></li>
</ul>
</li>
<li><a href="#org622b1a9">Using a src directory</a></li>
<li><a href="#orgdace107">Packaging</a>
<ul>
<li><a href="#org08a401d">Kinds of Packages</a>
<ul>
<li><a href="#orgf0f364a">wheel (.whl)</a></li>
<li><a href="#org03393e7">Source Tree (git)</a></li>
<li><a href="#org511af89">Source Distribution (sdist)</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgb325975">Package summary info</a>
<ul>
<li><a href="#org3972f6a">sys.path</a></li>
<li><a href="#org2d18e6b">site</a></li>
</ul>
</li>
<li><a href="#org6eb4df5">Class attributes</a></li>
<li><a href="#org40e7576">Require zip of github repo</a></li>
<li><a href="#orgb948bba">Strings</a>
<ul>
<li><a href="#orgcb121ef">Unicode</a></li>
<li><a href="#orgcedc9fd">Decode: convert bytes to UTF-8 string</a></li>
<li><a href="#org48f6bb4">Encode: convert UTF-8 string to bytes</a></li>
</ul>
</li>
<li><a href="#org42aafc1">Random String</a></li>
<li><a href="#orgd2a491d">How I Set Up Python</a></li>
</ul>
</div>
</nav>

<div id="outline-container-orgbe7c725" class="outline-2">
<h2 id="orgbe7c725"><a href="#orgbe7c725">Pyenv</a></h2>
<div class="outline-text-2" id="text-orgbe7c725">
</div>
<div id="outline-container-org023ad48" class="outline-3">
<h3 id="org023ad48"><a href="#org023ad48">Latest Version</a></h3>
<div class="outline-text-3" id="text-org023ad48">
<p>
In fish, you don't need the <code>\</code> in <code>dev\|rc</code>.
</p>

<div class="org-src-container">
<pre class="src src-sh" id="orgc2c9e6b">python-build --definitions <span style="color: #98be65;">\</span>
    | grep <span style="color: #98be65;">"^3"</span> <span style="color: #98be65;">\</span>
    | grep -v <span style="color: #98be65;">"dev\|rc"</span> <span style="color: #98be65;">\</span>
    | tail -n 1
</pre>
</div>

<div class="results">#+RESULTS:</div><pre class="example">
3.11.0a2
</pre>
</div>
</div>
</div>

<div id="outline-container-org622b1a9" class="outline-2">
<h2 id="org622b1a9"><a href="#org622b1a9">Using a src directory</a></h2>
<div class="outline-text-2" id="text-org622b1a9">
<ul class="org-ul">
<li><a href="https://blog.ionelmc.ro/2014/05/25/python-packaging/">Packaging a python library</a> (Ionel Cristian Mărieș)</li>
<li><a href="https://hynek.me/articles/testing-packaging/">Testing &amp; Packaging</a> (Hynek Schlawack)</li>
</ul>

<p>
I am currently a fan of the <code>src</code> directory. The main reasons for this are:
</p>

<ul class="org-ul">
<li>Ionel's first point about <i>import parity</i>; it is important that all your
top-level repo cruft isn't on your <code>sys.path</code> during local development.</li>
<li>A directory named <code>src</code> is explicit and says what it is.</li>
<li>Different python projects can have a more similar top-level directory layout
and a more similar <code>setup.cfg</code>.</li>
</ul>
</div>
</div>

<div id="outline-container-orgdace107" class="outline-2">
<h2 id="orgdace107"><a href="#orgdace107">Packaging</a></h2>
<div class="outline-text-2" id="text-orgdace107">
</div>
<div id="outline-container-org08a401d" class="outline-3">
<h3 id="org08a401d"><a href="#org08a401d">Kinds of Packages</a></h3>
<div class="outline-text-3" id="text-org08a401d">
<p>
From: <a href="https://bernat.tech/posts/pep-517-and-python-packaging/">https://bernat.tech/posts/pep-517-and-python-packaging/</a>
</p>
</div>

<div id="outline-container-orgf0f364a" class="outline-4">
<h4 id="orgf0f364a"><a href="#orgf0f364a">wheel (.whl)</a></h4>
<div class="outline-text-4" id="text-orgf0f364a">
<p>
The project is built and then zipped up. Building usually means executing
setuptools, which in turn may call build scripts in the project.
</p>

<p>
If the package includes native extensions, they are complied. This means a
separate wheel must be created and published for each computer architecture.
</p>

<p>
The zip includes the source code, the <code>.dist_info</code> directory, and potentiall
compiled native extensions. During a <code>pip install</code>, pip only needs to
extract the zip in the right location.
</p>
</div>
</div>

<div id="outline-container-org03393e7" class="outline-4">
<h4 id="org03393e7"><a href="#org03393e7">Source Tree (git)</a></h4>
<div class="outline-text-4" id="text-org03393e7">
<p>
Every file in the project's VC repository.
</p>
</div>
</div>

<div id="outline-container-org511af89" class="outline-4">
<h4 id="org511af89"><a href="#org511af89">Source Distribution (sdist)</a></h4>
<div class="outline-text-4" id="text-org511af89">
<p>
A zip of the project source code. It may not include <i>all</i> files in the
repository, like the <code>.git/</code>, <code>.github/</code>, <code>Jenkinsfile</code>, and tests (but I
think it can, right?). It must <i>at least</i> include the Python source code and
files required to build the project (<code>setup.cfg</code>, etc).
</p>

<p>
Does not include a <code>.dist_info/</code> or compiled extensions. During a <code>pip
    install</code>, pip needs to build the package, which usually means executing
<code>setuptools</code>, which in turn may call build scripts.
</p>

<p>
The installing user must:
</p>

<ul class="org-ul">
<li>Have an appropriate version of <code>setuptools</code></li>
<li>Have the tools required by the project build scripts</li>
</ul>
</div>
</div>
</div>
</div>

<div id="outline-container-orgb325975" class="outline-2">
<h2 id="orgb325975"><a href="#orgb325975">Package summary info</a></h2>
<div class="outline-text-2" id="text-orgb325975">
</div>
<div id="outline-container-org3972f6a" class="outline-3">
<h3 id="org3972f6a"><a href="#org3972f6a">sys.path</a></h3>
<div class="outline-text-3" id="text-org3972f6a">
<p>
As explained in the <a href="https://docs.python.org/3/library/sys.html#sys.path">docs</a>, the first element of <code>sys.path</code> is often the empty
string.
</p>

<blockquote>
<p>
&#x2026; the first item of this list, <code>path[0]</code>, is the directory containing the
script that was used to invoke the Python interpreter. If the script
directory is not available (e.g. if the interpreter is invoked interactively
or if the script is read from standard input), path[0] is the empty string,
which directs Python to search modules in the current directory first.
</p>
</blockquote>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #51afef;">import</span> sys; <span style="color: #51afef;">return</span> sys.path
</pre>
</div>
</div>
</div>

<div id="outline-container-org2d18e6b" class="outline-3">
<h3 id="org2d18e6b"><a href="#org2d18e6b">site</a></h3>
<div class="outline-text-3" id="text-org2d18e6b">
<p>
Print a summary including <code>sys.path</code> and some other stuff.
</p>

<div class="org-src-container">
<pre class="src src-sh">python -m site
</pre>
</div>

<p>
Interactively, in a python interpreter, <code>site_script()</code> prints some nice
stuff, but it causes the interpreter to exit! Ok for org-mode, not great for
an interactive python session.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #51afef;">import</span> site
site._script()
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org6eb4df5" class="outline-2">
<h2 id="org6eb4df5"><a href="#org6eb4df5">Class attributes</a></h2>
<div class="outline-text-2" id="text-org6eb4df5">
<p>
Define a class:
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #51afef;">class</span> <span style="color: #ECBE7B;">Pizza</span>(<span style="color: #c678dd;">object</span>):
    <span style="color: #51afef;">def</span> <span style="color: #c678dd;">__init__</span>(<span style="color: #51afef;">self</span>, size):
        <span style="color: #51afef;">self</span>.<span style="color: #dcaeea;">size</span> = size
    <span style="color: #51afef;">def</span> <span style="color: #c678dd;">get_size</span>(<span style="color: #51afef;">self</span>):
        <span style="color: #51afef;">return</span> <span style="color: #51afef;">self</span>.size
</pre>
</div>

<p>
Create an instance:
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #dcaeea;">p</span> = Pizza(8)
</pre>
</div>

<p>
From: <a href="https://blog.ionelmc.ro/2015/02/09/understanding-python-metaclasses/#object-attribute-lookup">https://blog.ionelmc.ro/2015/02/09/understanding-python-metaclasses/#object-attribute-lookup</a>
</p>

<p>
Now, calling <code>p.get_size()</code> or <code>p.size</code> roughly equates to:
</p>

<ol class="org-ol">
<li>Call the type slot for <code>Class.__getattribute__(attribute)</code>. The default
does this:

<ul class="org-ul">
<li>Does <code>Pizza.__dict__</code> have a <code>size</code> (or <code>get_size</code>) that has a <code>__get__</code>
method and is a data descriptor? (size: no, get<sub>size</sub>: no). Note:
functions are not data descriptors. A data descriptor must have at least
a <code>__set__</code> OR a <code>__delete__</code> attribute.</li>

<li>Else, does <code>p.__dict__</code> have a <code>size</code> (or <code>get_size</code>) item in it? (size:
yes, get<sub>size</sub>: no)</li>

<li>Else, does <code>Pizza.__dict__</code> have a <code>size</code> (or <code>get_size</code>) item that is
<b>not</b> a data descriptor?</li>
</ul></li>
</ol>

<div class="org-src-container">
<pre class="src src-python">Pizza.<span style="color: #c678dd;">__dict__</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-python">Pizza.<span style="color: #c678dd;">__dict__</span>[<span style="color: #98be65;">"get_size"</span>].__get__(p, Pizza)()
</pre>
</div>
</div>
</div>

<div id="outline-container-org40e7576" class="outline-2">
<h2 id="org40e7576"><a href="#org40e7576">Require zip of github repo</a></h2>
<div class="outline-text-2" id="text-org40e7576">
<p>
You can get a tarball or zipball of a repo as documented here:
<a href="https://developer.github.com/v3/repos/contents/#get-archive-link">https://developer.github.com/v3/repos/contents/#get-archive-link</a>
</p>

<p>
In requirements.txt, you can do something like
<a href="https://github.com/cfclrk/python-demo/zipball/master#egg=botocore">https://github.com/cfclrk/python-demo/zipball/master#egg=botocore</a>
</p>

<p>
e.g. see:
<a href="https://github.com/aws/aws-cli/blob/1973ca9709d41121b45c1a0d764ef6788028c708/requirements.txt#L6">https://github.com/aws/aws-cli/blob/1973ca9709d41121b45c1a0d764ef6788028c708/requirements.txt#L6</a>
</p>
</div>
</div>

<div id="outline-container-orgb948bba" class="outline-2">
<h2 id="orgb948bba"><a href="#orgb948bba">Strings</a></h2>
<div class="outline-text-2" id="text-orgb948bba">
</div>
<div id="outline-container-orgcb121ef" class="outline-3">
<h3 id="orgcb121ef"><a href="#orgcb121ef">Unicode</a></h3>
<div class="outline-text-3" id="text-orgcb121ef">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #51afef;">return</span> <span style="color: #c678dd;">len</span>(<span style="color: #98be65;">"&#128514;"</span>)
</pre>
</div>

<div class="results">#+RESULTS:</div><pre class="example">
1
</pre>


<p>
From: <a href="https://hsivonen.fi/string-length/">https://hsivonen.fi/string-length/</a>
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #51afef;">return</span> <span style="color: #c678dd;">len</span>(<span style="color: #98be65;">"&#129318;&#127996;&#8205;&#9794;&#65039;"</span>)
</pre>
</div>

<div class="results">#+RESULTS:</div><pre class="example">
5
</pre>
</div>
</div>

<div id="outline-container-orgcedc9fd" class="outline-3">
<h3 id="orgcedc9fd"><a href="#orgcedc9fd">Decode: convert bytes to UTF-8 string</a></h3>
<div class="outline-text-3" id="text-orgcedc9fd">
<p>
A "byte string" is a byte literal, which is an immutable sequence of bytes
(integers). A byte literal can be defined using ASCII characters up
through 127. Byte values 128-256 can be specified using an escape sequence or
hex codes (see: <a href="https://docs.python.org/3/library/stdtypes.html#bytes-objects">Bytes Objects</a>).
</p>

<p>
For example, this works:
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #dcaeea;">foo</span>=b<span style="color: #98be65;">"foo"</span>
</pre>
</div>

<p>
But this does not:
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #dcaeea;">bar</span>=b<span style="color: #98be65;">"&#1054;&#1060;&#1048;&#1057;"</span>
</pre>
</div>

<pre class="example" id="orgae52bc4">
  File "&lt;stdin&gt;", line 1
SyntaxError: bytes can only contain ASCII literal characters.
</pre>

<p>
To get a Python 3 string from bytes, you must know what text encoding was
used to create the bytes. Usually, it's ASCII:
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #dcaeea;">foo</span> = b<span style="color: #98be65;">"foo"</span>
<span style="color: #51afef;">return</span> foo.decode(<span style="color: #98be65;">"ascii"</span>)
</pre>
</div>

<div class="results">#+RESULTS:</div><pre class="example">
foo
</pre>


<p>
What's going on is:
</p>

<ul class="org-ul">
<li><code>foo</code> is a byte literal (array of integers)</li>
<li>For each array item, decode it using the ASCII codec, then encode it with UTF-8</li>
<li>The result is a UTF-8 encoded string</li>
</ul>
</div>
</div>

<div id="outline-container-org48f6bb4" class="outline-3">
<h3 id="org48f6bb4"><a href="#org48f6bb4">Encode: convert UTF-8 string to bytes</a></h3>
<div class="outline-text-3" id="text-org48f6bb4">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #51afef;">return</span> <span style="color: #98be65;">"foo"</span>.encode(<span style="color: #98be65;">"ascii"</span>)
</pre>
</div>

<div class="results">#+RESULTS:</div><pre class="example">
b'foo'
</pre>


<div class="org-src-container">
<pre class="src src-python"><span style="color: #dcaeea;">bar</span>=<span style="color: #98be65;">"&#1054;&#1060;&#1048;&#1057;"</span>
<span style="color: #51afef;">return</span> bar.encode(<span style="color: #98be65;">"utf-8"</span>)
</pre>
</div>

<div class="results">#+RESULTS:</div><pre class="example">
b'\xd0\x9e\xd0\xa4\xd0\x98\xd0\xa1'
</pre>


<div class="org-src-container">
<pre class="src src-python"><span style="color: #51afef;">return</span>  <span style="color: #98be65;">"&#128514;"</span>.encode(<span style="color: #98be65;">"ascii"</span>)
</pre>
</div>

<p>
Prints:
</p>

<pre class="example" id="orgdcf12b1">
&gt;&gt;&gt; "😂".encode("ascii")
Traceback (most recent call last):
  File "&lt;stdin&gt;", line 1, in &lt;module&gt;
UnicodeEncodeError: 'ascii' codec can't encode
character '\U0001f602' in position 0: ordinal not
in range(128)
</pre>
</div>
</div>
</div>

<div id="outline-container-org42aafc1" class="outline-2">
<h2 id="org42aafc1"><a href="#org42aafc1">Random String</a></h2>
<div class="outline-text-2" id="text-org42aafc1">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #51afef;">import</span> random
<span style="color: #51afef;">import</span> string
<span style="color: #51afef;">return</span> <span style="color: #98be65;">""</span>.join(random.choice(string.ascii_letters) <span style="color: #51afef;">for</span> _ <span style="color: #51afef;">in</span> <span style="color: #c678dd;">range</span>(8))
</pre>
</div>

<div class="results">#+RESULTS:</div><pre class="example">
knMyinMG
</pre>
</div>
</div>

<div id="outline-container-orgd2a491d" class="outline-2">
<h2 id="orgd2a491d"><a href="#orgd2a491d">How I Set Up Python</a></h2>
<div class="outline-text-2" id="text-orgd2a491d">
<p>
Use <code>pyenv</code> to install python versions, and <code>pyenv-virtualenv</code> to create
virtual environments per project.
</p>

<p>
First, install a couple versions of python.
</p>

<div class="org-src-container">
<pre class="src src-bash">pyenv install $<span style="color: #dcaeea;">LatestPython</span>
pyenv install 3.6.8
</pre>
</div>

<p>
I set <code>pyenv global</code> to the latest python I have installed. This is so that
one-off python commands on the CLI use a tolerable version of python
regardless of what directory the CLI is in.
</p>

<p>
I actually set <code>pyenv global</code> to a virtual environment based on the latest
python I have installed. This way, whenever the global python environment gets
too cluttered with pip packages, I just blow it away and recreate it.
</p>

<p>
Global virtual environment name:
</p>

<div class="org-src-container">
<pre class="src src-sh" id="org0931d1b"><span style="color: #c678dd;">echo</span> $<span style="color: #dcaeea;">LatestPython</span> | sed s/<span style="color: #98be65;">\\</span>.//g
</pre>
</div>

<div class="results">#+RESULTS:</div><pre class="example">
397
</pre>


<p>
Create a virtual environment for the global python, and set <code>pyenv global</code> to
it.
</p>

<div class="org-src-container">
<pre class="src src-bash">pyenv virtualenv $<span style="color: #dcaeea;">LatestPython</span> $<span style="color: #dcaeea;">GlobalVenv</span>
pyenv global $<span style="color: #dcaeea;">GlobalVenv</span>
</pre>
</div>
</div>
</div>
</div>
</body>
</html>
